wosayttn/M55M1BSP/Library/StdDriver/src/lpspi.c
    /* Check slave selection signal inactive interrupt flag */
    if ((u32Mask & LPSPI_SSINACT_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_SSINACT_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_SLVURIF_Msk;

    /* Check slave TX under run interrupt flag */
    if ((u32Mask & LPSPI_SLVUR_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_SLVUR_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_SLVBEIF_Msk;

    /* Check slave bit count error interrupt flag */
    if ((u32Mask & LPSPI_SLVBE_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_SLVBE_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_TXUFIF_Msk;

    /* Check slave TX underflow interrupt flag */
    if ((u32Mask & LPSPI_TXUF_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_TXUF_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_TXTHIF_Msk;

    /* Check TX threshold interrupt flag */
    if ((u32Mask & LPSPI_FIFO_TXTH_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_FIFO_TXTH_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_RXTHIF_Msk;

    /* Check RX threshold interrupt flag */
    if ((u32Mask & LPSPI_FIFO_RXTH_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_FIFO_RXTH_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_RXOVIF_Msk;

    /* Check RX overrun interrupt flag */
    if ((u32Mask & LPSPI_FIFO_RXOV_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_FIFO_RXOV_INT_MASK;
    }

    u32TmpVal = lpspi->STATUS & LPSPI_STATUS_RXTOIF_Msk;

    /* Check RX time-out interrupt flag */
    if ((u32Mask & LPSPI_FIFO_RXTO_INT_MASK) && (u32TmpVal))
    {
        u32IntFlag |= LPSPI_FIFO_RXTO_INT_MASK;
    }

    return u32IntFlag;
}

/**
  * @brief  Clear interrupt flag.
  * @param[in]  lpspi The pointer of the specified LPSPI module.
  * @param[in]  u32Mask The combination of all related interrupt sources.
  *                     Each bit corresponds to a interrupt source.
  *                     This parameter decides which interrupt flags will be cleared. It could be the combination of:
  *                       - \ref LPSPI_UNIT_INT_MASK
  *                       - \ref LPSPI_SSACT_INT_MASK
  *                       - \ref LPSPI_SSINACT_INT_MASK
  *                       - \ref LPSPI_SLVUR_INT_MASK
  *                       - \ref LPSPI_SLVBE_INT_MASK
  *                       - \ref LPSPI_TXUF_INT_MASK
  *                       - \ref LPSPI_FIFO_RXOV_INT_MASK
  *                       - \ref LPSPI_FIFO_RXTO_INT_MASK
  *
  * @details Clear LPSPI related interrupt flags specified by u32Mask parameter.
  */
void LPSPI_ClearIntFlag(LPSPI_T *lpspi, uint32_t u32Mask)
{
    if (u32Mask & LPSPI_UNIT_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_UNITIF_Msk; /* Clear unit transfer interrupt flag */
    }

    if (u32Mask & LPSPI_SSACT_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_SSACTIF_Msk; /* Clear slave selection signal active interrupt flag */
    }

    if (u32Mask & LPSPI_SSINACT_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_SSINAIF_Msk; /* Clear slave selection signal inactive interrupt flag */
    }

    if (u32Mask & LPSPI_SLVUR_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_SLVURIF_Msk; /* Clear slave TX under run interrupt flag */
    }

    if (u32Mask & LPSPI_SLVBE_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_SLVBEIF_Msk; /* Clear slave bit count error interrupt flag */
    }

    if (u32Mask & LPSPI_TXUF_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_TXUFIF_Msk; /* Clear slave TX underflow interrupt flag */
    }

    if (u32Mask & LPSPI_FIFO_RXOV_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_RXOVIF_Msk; /* Clear RX overrun interrupt flag */
    }

    if (u32Mask & LPSPI_FIFO_RXTO_INT_MASK)
    {
        lpspi->STATUS = LPSPI_STATUS_RXTOIF_Msk; /* Clear RX time-out interrupt flag */
    }
}

/**
  * @brief  Get LPSPI status.
  * @param[in]  lpspi The pointer of the specified LPSPI module.
  * @param[in]  u32Mask The combination of all related sources.
  *                     Each bit corresponds to a source.
  *                     This parameter decides which flags will be read. It is combination of:
  *                       - \ref LPSPI_BUSY_MASK
  *                       - \ref LPSPI_RX_EMPTY_MASK
  *                       - \ref LPSPI_RX_FULL_MASK
  *                       - \ref LPSPI_TX_EMPTY_MASK
  *                       - \ref LPSPI_TX_FULL_MASK
  *                       - \ref LPSPI_TXRX_RESET_MASK
  *                       - \ref LPSPI_SPIEN_STS_MASK
  *                       - \ref LPSPI_SSLINE_STS_MASK
  *
  * @return Flags of selected sources.
  * @details Get LPSPI related status specified by u32Mask parameter.
  */
uint32_t LPSPI_GetStatus(LPSPI_T *lpspi, uint32_t u32Mask)
{
    uint32_t u32Flag = 0U, u32TmpValue;

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_BUSY_Msk;

    /* Check busy status */
    if ((u32Mask & LPSPI_BUSY_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_BUSY_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_RXEMPTY_Msk;

    /* Check RX empty flag */
    if ((u32Mask & LPSPI_RX_EMPTY_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_RX_EMPTY_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_RXFULL_Msk;

    /* Check RX full flag */
    if ((u32Mask & LPSPI_RX_FULL_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_RX_FULL_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_TXEMPTY_Msk;

    /* Check TX empty flag */
    if ((u32Mask & LPSPI_TX_EMPTY_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_TX_EMPTY_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_TXFULL_Msk;

    /* Check TX full flag */
    if ((u32Mask & LPSPI_TX_FULL_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_TX_FULL_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_TXRXRST_Msk;

    /* Check TX/RX reset flag */
    if ((u32Mask & LPSPI_TXRX_RESET_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_TXRX_RESET_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_SPIENSTS_Msk;

    /* Check SPIEN flag */
    if ((u32Mask & LPSPI_SPIEN_STS_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_SPIEN_STS_MASK;
    }

    u32TmpValue = lpspi->STATUS & LPSPI_STATUS_SSLINE_Msk;

    /* Check SPIx_SS line status */
    if ((u32Mask & LPSPI_SSLINE_STS_MASK) && (u32TmpValue))
    {
        u32Flag |= LPSPI_SSLINE_STS_MASK;
    }

    return u32Flag;
}

/** @} end of group LPSPI_EXPORTED_FUNCTIONS */
/** @} end of group LPSPI_Driver */
/** @} end of group Standard_Driver */
